app/controllers/posts_controller.rb

INSERT INTO "posts" ("img_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["img_url", "https://i.imgur.com/xYVloqv.jpg"], ["user_id", 5], ["created_at", "2021-12-11 02:17:11.216447"], ["updated_at", "2021-12-11 02:17:11.216447"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = @current_user

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 26], ["LIMIT", 1]]
UPDATE "posts" SET "caption" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["caption", "testing"], ["updated_at", "2021-12-11 03:00:06.613418"], ["id", 26]]
---
  def update
    @post = @current_user.posts.find(params[:id])
    if @post.update(post_params)

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 26], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 26]]
---
  def destroy
    @post = @current_user.posts.find(params[:id])
    @post.destroy